(6000, 18, 2048) Counter({0: 1000, 3: 1000, 1: 1000, 4: 1000, 5: 1000, 2: 1000})
----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv1d-1            [-1, 128, 2048]          36,992
   MyConv1dPadSame-2            [-1, 128, 2048]               0
       BatchNorm1d-3            [-1, 128, 2048]             256
              ReLU-4            [-1, 128, 2048]               0
            Conv1d-5            [-1, 128, 2048]           8,320
   MyConv1dPadSame-6            [-1, 128, 2048]               0
       BatchNorm1d-7            [-1, 128, 2048]             256
              ReLU-8            [-1, 128, 2048]               0
           Dropout-9            [-1, 128, 2048]               0
           Conv1d-10            [-1, 128, 2048]           8,320
  MyConv1dPadSame-11            [-1, 128, 2048]               0
       Bottleneck-12            [-1, 128, 2048]               0
      BatchNorm1d-13            [-1, 128, 2048]             256
             ReLU-14            [-1, 128, 2048]               0
          Dropout-15            [-1, 128, 2048]               0
           Conv1d-16            [-1, 128, 1024]           8,320
  MyConv1dPadSame-17            [-1, 128, 1024]               0
      BatchNorm1d-18            [-1, 128, 1024]             256
             ReLU-19            [-1, 128, 1024]               0
          Dropout-20            [-1, 128, 1024]               0
           Conv1d-21            [-1, 128, 1024]           8,320
  MyConv1dPadSame-22            [-1, 128, 1024]               0
        MaxPool1d-23            [-1, 128, 1024]               0
MyMaxPool1dPadSame-24            [-1, 128, 1024]               0
       Bottleneck-25            [-1, 128, 1024]               0
      BatchNorm1d-26            [-1, 128, 1024]             256
             ReLU-27            [-1, 128, 1024]               0
          Dropout-28            [-1, 128, 1024]               0
           Conv1d-29            [-1, 128, 1024]           8,320
  MyConv1dPadSame-30            [-1, 128, 1024]               0
      BatchNorm1d-31            [-1, 128, 1024]             256
             ReLU-32            [-1, 128, 1024]               0
          Dropout-33            [-1, 128, 1024]               0
           Conv1d-34            [-1, 128, 1024]           8,320
  MyConv1dPadSame-35            [-1, 128, 1024]               0
       Bottleneck-36            [-1, 128, 1024]               0
      BatchNorm1d-37            [-1, 128, 1024]             256
             ReLU-38            [-1, 128, 1024]               0
          Dropout-39            [-1, 128, 1024]               0
           Conv1d-40            [-1, 128, 1024]           8,320
  MyConv1dPadSame-41            [-1, 128, 1024]               0
      BatchNorm1d-42            [-1, 128, 1024]             256
             ReLU-43            [-1, 128, 1024]               0
          Dropout-44            [-1, 128, 1024]               0
           Conv1d-45            [-1, 128, 1024]           8,320
  MyConv1dPadSame-46            [-1, 128, 1024]               0
       Bottleneck-47            [-1, 128, 1024]               0
      BatchNorm1d-48            [-1, 128, 1024]             256
             ReLU-49            [-1, 128, 1024]               0
          Dropout-50            [-1, 128, 1024]               0
           Conv1d-51            [-1, 128, 1024]           8,320
  MyConv1dPadSame-52            [-1, 128, 1024]               0
      BatchNorm1d-53            [-1, 128, 1024]             256
             ReLU-54            [-1, 128, 1024]               0
          Dropout-55            [-1, 128, 1024]               0
           Conv1d-56            [-1, 128, 1024]           8,320
  MyConv1dPadSame-57            [-1, 128, 1024]               0
       Bottleneck-58            [-1, 128, 1024]               0
      BatchNorm1d-59            [-1, 128, 1024]             256
             ReLU-60            [-1, 128, 1024]               0
          Dropout-61            [-1, 128, 1024]               0
           Conv1d-62            [-1, 128, 1024]           8,320
  MyConv1dPadSame-63            [-1, 128, 1024]               0
      BatchNorm1d-64            [-1, 128, 1024]             256
             ReLU-65            [-1, 128, 1024]               0
          Dropout-66            [-1, 128, 1024]               0
           Conv1d-67            [-1, 128, 1024]           8,320
  MyConv1dPadSame-68            [-1, 128, 1024]               0
       Bottleneck-69            [-1, 128, 1024]               0
      BatchNorm1d-70            [-1, 128, 1024]             256
             ReLU-71            [-1, 128, 1024]               0
          Dropout-72            [-1, 128, 1024]               0
           Conv1d-73            [-1, 128, 1024]           8,320
  MyConv1dPadSame-74            [-1, 128, 1024]               0
      BatchNorm1d-75            [-1, 128, 1024]             256
             ReLU-76            [-1, 128, 1024]               0
          Dropout-77            [-1, 128, 1024]               0
           Conv1d-78            [-1, 128, 1024]           8,320
  MyConv1dPadSame-79            [-1, 128, 1024]               0
       Bottleneck-80            [-1, 128, 1024]               0
      BatchNorm1d-81            [-1, 128, 1024]             256
             ReLU-82            [-1, 128, 1024]               0
          Dropout-83            [-1, 128, 1024]               0
           Conv1d-84             [-1, 128, 512]           8,320
  MyConv1dPadSame-85             [-1, 128, 512]               0
      BatchNorm1d-86             [-1, 128, 512]             256
             ReLU-87             [-1, 128, 512]               0
          Dropout-88             [-1, 128, 512]               0
           Conv1d-89             [-1, 128, 512]           8,320
  MyConv1dPadSame-90             [-1, 128, 512]               0
        MaxPool1d-91             [-1, 128, 512]               0
MyMaxPool1dPadSame-92             [-1, 128, 512]               0
       Bottleneck-93             [-1, 128, 512]               0
      BatchNorm1d-94             [-1, 128, 512]             256
             ReLU-95             [-1, 128, 512]               0
          Dropout-96             [-1, 128, 512]               0
           Conv1d-97             [-1, 128, 512]           8,320
  MyConv1dPadSame-98             [-1, 128, 512]               0
      BatchNorm1d-99             [-1, 128, 512]             256
            ReLU-100             [-1, 128, 512]               0
         Dropout-101             [-1, 128, 512]               0
          Conv1d-102             [-1, 128, 512]           8,320
 MyConv1dPadSame-103             [-1, 128, 512]               0
      Bottleneck-104             [-1, 128, 512]               0
     BatchNorm1d-105             [-1, 128, 512]             256
            ReLU-106             [-1, 128, 512]               0
         Dropout-107             [-1, 128, 512]               0
          Conv1d-108             [-1, 128, 512]           8,320
 MyConv1dPadSame-109             [-1, 128, 512]               0
     BatchNorm1d-110             [-1, 128, 512]             256
            ReLU-111             [-1, 128, 512]               0
         Dropout-112             [-1, 128, 512]               0
          Conv1d-113             [-1, 128, 512]           8,320
 MyConv1dPadSame-114             [-1, 128, 512]               0
      Bottleneck-115             [-1, 128, 512]               0
     BatchNorm1d-116             [-1, 128, 512]             256
            ReLU-117             [-1, 128, 512]               0
         Dropout-118             [-1, 128, 512]               0
          Conv1d-119             [-1, 128, 512]           8,320
 MyConv1dPadSame-120             [-1, 128, 512]               0
     BatchNorm1d-121             [-1, 128, 512]             256
            ReLU-122             [-1, 128, 512]               0
         Dropout-123             [-1, 128, 512]               0
          Conv1d-124             [-1, 128, 512]           8,320
 MyConv1dPadSame-125             [-1, 128, 512]               0
      Bottleneck-126             [-1, 128, 512]               0
     BatchNorm1d-127             [-1, 128, 512]             256
            ReLU-128             [-1, 128, 512]               0
         Dropout-129             [-1, 128, 512]               0
          Conv1d-130             [-1, 128, 512]           8,320
 MyConv1dPadSame-131             [-1, 128, 512]               0
     BatchNorm1d-132             [-1, 128, 512]             256
            ReLU-133             [-1, 128, 512]               0
         Dropout-134             [-1, 128, 512]               0
          Conv1d-135             [-1, 128, 512]           8,320
 MyConv1dPadSame-136             [-1, 128, 512]               0
      Bottleneck-137             [-1, 128, 512]               0
     BatchNorm1d-138             [-1, 128, 512]             256
            ReLU-139             [-1, 128, 512]               0
         Dropout-140             [-1, 128, 512]               0
          Conv1d-141             [-1, 256, 512]          16,640
 MyConv1dPadSame-142             [-1, 256, 512]               0
     BatchNorm1d-143             [-1, 256, 512]             512
            ReLU-144             [-1, 256, 512]               0
         Dropout-145             [-1, 256, 512]               0
          Conv1d-146             [-1, 256, 512]          33,024
 MyConv1dPadSame-147             [-1, 256, 512]               0
      Bottleneck-148             [-1, 256, 512]               0
     BatchNorm1d-149             [-1, 256, 512]             512
            ReLU-150             [-1, 256, 512]               0
         Dropout-151             [-1, 256, 512]               0
          Conv1d-152             [-1, 256, 256]          33,024
 MyConv1dPadSame-153             [-1, 256, 256]               0
     BatchNorm1d-154             [-1, 256, 256]             512
            ReLU-155             [-1, 256, 256]               0
         Dropout-156             [-1, 256, 256]               0
          Conv1d-157             [-1, 256, 256]          33,024
 MyConv1dPadSame-158             [-1, 256, 256]               0
       MaxPool1d-159             [-1, 256, 256]               0
MyMaxPool1dPadSame-160             [-1, 256, 256]               0
      Bottleneck-161             [-1, 256, 256]               0
     BatchNorm1d-162             [-1, 256, 256]             512
            ReLU-163             [-1, 256, 256]               0
         Dropout-164             [-1, 256, 256]               0
          Conv1d-165             [-1, 256, 256]          33,024
 MyConv1dPadSame-166             [-1, 256, 256]               0
     BatchNorm1d-167             [-1, 256, 256]             512
            ReLU-168             [-1, 256, 256]               0
         Dropout-169             [-1, 256, 256]               0
          Conv1d-170             [-1, 256, 256]          33,024
 MyConv1dPadSame-171             [-1, 256, 256]               0
      Bottleneck-172             [-1, 256, 256]               0
     BatchNorm1d-173             [-1, 256, 256]             512
            ReLU-174             [-1, 256, 256]               0
         Dropout-175             [-1, 256, 256]               0
          Conv1d-176             [-1, 256, 256]          33,024
 MyConv1dPadSame-177             [-1, 256, 256]               0
     BatchNorm1d-178             [-1, 256, 256]             512
            ReLU-179             [-1, 256, 256]               0
         Dropout-180             [-1, 256, 256]               0
          Conv1d-181             [-1, 256, 256]          33,024
 MyConv1dPadSame-182             [-1, 256, 256]               0
      Bottleneck-183             [-1, 256, 256]               0
     BatchNorm1d-184             [-1, 256, 256]             512
            ReLU-185             [-1, 256, 256]               0
         Dropout-186             [-1, 256, 256]               0
          Conv1d-187             [-1, 256, 256]          33,024
 MyConv1dPadSame-188             [-1, 256, 256]               0
     BatchNorm1d-189             [-1, 256, 256]             512
            ReLU-190             [-1, 256, 256]               0
         Dropout-191             [-1, 256, 256]               0
          Conv1d-192             [-1, 256, 256]          33,024
 MyConv1dPadSame-193             [-1, 256, 256]               0
      Bottleneck-194             [-1, 256, 256]               0
     BatchNorm1d-195             [-1, 256, 256]             512
            ReLU-196             [-1, 256, 256]               0
         Dropout-197             [-1, 256, 256]               0
          Conv1d-198             [-1, 256, 256]          33,024
 MyConv1dPadSame-199             [-1, 256, 256]               0
     BatchNorm1d-200             [-1, 256, 256]             512
            ReLU-201             [-1, 256, 256]               0
         Dropout-202             [-1, 256, 256]               0
          Conv1d-203             [-1, 256, 256]          33,024
 MyConv1dPadSame-204             [-1, 256, 256]               0
      Bottleneck-205             [-1, 256, 256]               0
     BatchNorm1d-206             [-1, 256, 256]             512
            ReLU-207             [-1, 256, 256]               0
         Dropout-208             [-1, 256, 256]               0
          Conv1d-209             [-1, 256, 256]          33,024
 MyConv1dPadSame-210             [-1, 256, 256]               0
     BatchNorm1d-211             [-1, 256, 256]             512
            ReLU-212             [-1, 256, 256]               0
         Dropout-213             [-1, 256, 256]               0
          Conv1d-214             [-1, 256, 256]          33,024
 MyConv1dPadSame-215             [-1, 256, 256]               0
      Bottleneck-216             [-1, 256, 256]               0
     BatchNorm1d-217             [-1, 256, 256]             512
            ReLU-218             [-1, 256, 256]               0
         Dropout-219             [-1, 256, 256]               0
          Conv1d-220             [-1, 256, 128]          33,024
 MyConv1dPadSame-221             [-1, 256, 128]               0
     BatchNorm1d-222             [-1, 256, 128]             512
            ReLU-223             [-1, 256, 128]               0
         Dropout-224             [-1, 256, 128]               0
          Conv1d-225             [-1, 256, 128]          33,024
 MyConv1dPadSame-226             [-1, 256, 128]               0
       MaxPool1d-227             [-1, 256, 128]               0
MyMaxPool1dPadSame-228             [-1, 256, 128]               0
      Bottleneck-229             [-1, 256, 128]               0
     BatchNorm1d-230             [-1, 256, 128]             512
            ReLU-231             [-1, 256, 128]               0
         Dropout-232             [-1, 256, 128]               0
          Conv1d-233             [-1, 256, 128]          33,024
 MyConv1dPadSame-234             [-1, 256, 128]               0
     BatchNorm1d-235             [-1, 256, 128]             512
            ReLU-236             [-1, 256, 128]               0
         Dropout-237             [-1, 256, 128]               0
          Conv1d-238             [-1, 256, 128]          33,024
 MyConv1dPadSame-239             [-1, 256, 128]               0
      Bottleneck-240             [-1, 256, 128]               0
     BatchNorm1d-241             [-1, 256, 128]             512
            ReLU-242             [-1, 256, 128]               0
         Dropout-243             [-1, 256, 128]               0
          Conv1d-244             [-1, 256, 128]          33,024
 MyConv1dPadSame-245             [-1, 256, 128]               0
     BatchNorm1d-246             [-1, 256, 128]             512
            ReLU-247             [-1, 256, 128]               0
         Dropout-248             [-1, 256, 128]               0
          Conv1d-249             [-1, 256, 128]          33,024
 MyConv1dPadSame-250             [-1, 256, 128]               0
      Bottleneck-251             [-1, 256, 128]               0
     BatchNorm1d-252             [-1, 256, 128]             512
            ReLU-253             [-1, 256, 128]               0
         Dropout-254             [-1, 256, 128]               0
          Conv1d-255             [-1, 256, 128]          33,024
 MyConv1dPadSame-256             [-1, 256, 128]               0
     BatchNorm1d-257             [-1, 256, 128]             512
            ReLU-258             [-1, 256, 128]               0
         Dropout-259             [-1, 256, 128]               0
          Conv1d-260             [-1, 256, 128]          33,024
 MyConv1dPadSame-261             [-1, 256, 128]               0
      Bottleneck-262             [-1, 256, 128]               0
     BatchNorm1d-263             [-1, 256, 128]             512
            ReLU-264             [-1, 256, 128]               0
         Dropout-265             [-1, 256, 128]               0
          Conv1d-266             [-1, 256, 128]          33,024
 MyConv1dPadSame-267             [-1, 256, 128]               0
     BatchNorm1d-268             [-1, 256, 128]             512
            ReLU-269             [-1, 256, 128]               0
         Dropout-270             [-1, 256, 128]               0
          Conv1d-271             [-1, 256, 128]          33,024
 MyConv1dPadSame-272             [-1, 256, 128]               0
      Bottleneck-273             [-1, 256, 128]               0
     BatchNorm1d-274             [-1, 256, 128]             512
            ReLU-275             [-1, 256, 128]               0
         Dropout-276             [-1, 256, 128]               0
          Conv1d-277             [-1, 512, 128]          66,048
 MyConv1dPadSame-278             [-1, 512, 128]               0
     BatchNorm1d-279             [-1, 512, 128]           1,024
            ReLU-280             [-1, 512, 128]               0
         Dropout-281             [-1, 512, 128]               0
          Conv1d-282             [-1, 512, 128]         131,584
 MyConv1dPadSame-283             [-1, 512, 128]               0
      Bottleneck-284             [-1, 512, 128]               0
     BatchNorm1d-285             [-1, 512, 128]           1,024
            ReLU-286             [-1, 512, 128]               0
         Dropout-287             [-1, 512, 128]               0
          Conv1d-288              [-1, 512, 64]         131,584
 MyConv1dPadSame-289              [-1, 512, 64]               0
     BatchNorm1d-290              [-1, 512, 64]           1,024
            ReLU-291              [-1, 512, 64]               0
         Dropout-292              [-1, 512, 64]               0
          Conv1d-293              [-1, 512, 64]         131,584
 MyConv1dPadSame-294              [-1, 512, 64]               0
       MaxPool1d-295              [-1, 512, 64]               0
MyMaxPool1dPadSame-296              [-1, 512, 64]               0
      Bottleneck-297              [-1, 512, 64]               0
     BatchNorm1d-298              [-1, 512, 64]           1,024
            ReLU-299              [-1, 512, 64]               0
         Dropout-300              [-1, 512, 64]               0
          Conv1d-301              [-1, 512, 64]         131,584
 MyConv1dPadSame-302              [-1, 512, 64]               0
     BatchNorm1d-303              [-1, 512, 64]           1,024
            ReLU-304              [-1, 512, 64]               0
         Dropout-305              [-1, 512, 64]               0
          Conv1d-306              [-1, 512, 64]         131,584
 MyConv1dPadSame-307              [-1, 512, 64]               0
      Bottleneck-308              [-1, 512, 64]               0
     BatchNorm1d-309              [-1, 512, 64]           1,024
            ReLU-310              [-1, 512, 64]               0
         Dropout-311              [-1, 512, 64]               0
          Conv1d-312              [-1, 512, 64]         131,584
 MyConv1dPadSame-313              [-1, 512, 64]               0
     BatchNorm1d-314              [-1, 512, 64]           1,024
            ReLU-315              [-1, 512, 64]               0
         Dropout-316              [-1, 512, 64]               0
          Conv1d-317              [-1, 512, 64]         131,584
 MyConv1dPadSame-318              [-1, 512, 64]               0
      Bottleneck-319              [-1, 512, 64]               0
     BatchNorm1d-320              [-1, 512, 64]           1,024
            ReLU-321              [-1, 512, 64]               0
         Dropout-322              [-1, 512, 64]               0
          Conv1d-323              [-1, 512, 64]         131,584
 MyConv1dPadSame-324              [-1, 512, 64]               0
     BatchNorm1d-325              [-1, 512, 64]           1,024
            ReLU-326              [-1, 512, 64]               0
         Dropout-327              [-1, 512, 64]               0
          Conv1d-328              [-1, 512, 64]         131,584
 MyConv1dPadSame-329              [-1, 512, 64]               0
      Bottleneck-330              [-1, 512, 64]               0
     BatchNorm1d-331              [-1, 512, 64]           1,024
            ReLU-332              [-1, 512, 64]               0
         Dropout-333              [-1, 512, 64]               0
          Conv1d-334              [-1, 512, 64]         131,584
 MyConv1dPadSame-335              [-1, 512, 64]               0
     BatchNorm1d-336              [-1, 512, 64]           1,024
            ReLU-337              [-1, 512, 64]               0
         Dropout-338              [-1, 512, 64]               0
          Conv1d-339              [-1, 512, 64]         131,584
 MyConv1dPadSame-340              [-1, 512, 64]               0
      Bottleneck-341              [-1, 512, 64]               0
     BatchNorm1d-342              [-1, 512, 64]           1,024
            ReLU-343              [-1, 512, 64]               0
         Dropout-344              [-1, 512, 64]               0
          Conv1d-345              [-1, 512, 64]         131,584
 MyConv1dPadSame-346              [-1, 512, 64]               0
     BatchNorm1d-347              [-1, 512, 64]           1,024
            ReLU-348              [-1, 512, 64]               0
         Dropout-349              [-1, 512, 64]               0
          Conv1d-350              [-1, 512, 64]         131,584
 MyConv1dPadSame-351              [-1, 512, 64]               0
      Bottleneck-352              [-1, 512, 64]               0
     BatchNorm1d-353              [-1, 512, 64]           1,024
            ReLU-354              [-1, 512, 64]               0
         Dropout-355              [-1, 512, 64]               0
          Conv1d-356              [-1, 512, 32]         131,584
 MyConv1dPadSame-357              [-1, 512, 32]               0
     BatchNorm1d-358              [-1, 512, 32]           1,024
            ReLU-359              [-1, 512, 32]               0
         Dropout-360              [-1, 512, 32]               0
          Conv1d-361              [-1, 512, 32]         131,584
 MyConv1dPadSame-362              [-1, 512, 32]               0
       MaxPool1d-363              [-1, 512, 32]               0
MyMaxPool1dPadSame-364              [-1, 512, 32]               0
      Bottleneck-365              [-1, 512, 32]               0
     BatchNorm1d-366              [-1, 512, 32]           1,024
            ReLU-367              [-1, 512, 32]               0
         Dropout-368              [-1, 512, 32]               0
          Conv1d-369              [-1, 512, 32]         131,584
 MyConv1dPadSame-370              [-1, 512, 32]               0
     BatchNorm1d-371              [-1, 512, 32]           1,024
            ReLU-372              [-1, 512, 32]               0
         Dropout-373              [-1, 512, 32]               0
          Conv1d-374              [-1, 512, 32]         131,584
 MyConv1dPadSame-375              [-1, 512, 32]               0
      Bottleneck-376              [-1, 512, 32]               0
     BatchNorm1d-377              [-1, 512, 32]           1,024
            ReLU-378              [-1, 512, 32]               0
         Dropout-379              [-1, 512, 32]               0
          Conv1d-380              [-1, 512, 32]         131,584
 MyConv1dPadSame-381              [-1, 512, 32]               0
     BatchNorm1d-382              [-1, 512, 32]           1,024
            ReLU-383              [-1, 512, 32]               0
         Dropout-384              [-1, 512, 32]               0
          Conv1d-385              [-1, 512, 32]         131,584
 MyConv1dPadSame-386              [-1, 512, 32]               0
      Bottleneck-387              [-1, 512, 32]               0
     BatchNorm1d-388              [-1, 512, 32]           1,024
            ReLU-389              [-1, 512, 32]               0
         Dropout-390              [-1, 512, 32]               0
          Conv1d-391              [-1, 512, 32]         131,584
 MyConv1dPadSame-392              [-1, 512, 32]               0
     BatchNorm1d-393              [-1, 512, 32]           1,024
            ReLU-394              [-1, 512, 32]               0
         Dropout-395              [-1, 512, 32]               0
          Conv1d-396              [-1, 512, 32]         131,584
 MyConv1dPadSame-397              [-1, 512, 32]               0
      Bottleneck-398              [-1, 512, 32]               0
     BatchNorm1d-399              [-1, 512, 32]           1,024
            ReLU-400              [-1, 512, 32]               0
         Dropout-401              [-1, 512, 32]               0
          Conv1d-402              [-1, 512, 32]         131,584
 MyConv1dPadSame-403              [-1, 512, 32]               0
     BatchNorm1d-404              [-1, 512, 32]           1,024
            ReLU-405              [-1, 512, 32]               0
         Dropout-406              [-1, 512, 32]               0
          Conv1d-407              [-1, 512, 32]         131,584
 MyConv1dPadSame-408              [-1, 512, 32]               0
      Bottleneck-409              [-1, 512, 32]               0
     BatchNorm1d-410              [-1, 512, 32]           1,024
            ReLU-411              [-1, 512, 32]               0
         Dropout-412              [-1, 512, 32]               0
          Conv1d-413             [-1, 1024, 32]         263,168
 MyConv1dPadSame-414             [-1, 1024, 32]               0
     BatchNorm1d-415             [-1, 1024, 32]           2,048
            ReLU-416             [-1, 1024, 32]               0
         Dropout-417             [-1, 1024, 32]               0
          Conv1d-418             [-1, 1024, 32]         525,312
 MyConv1dPadSame-419             [-1, 1024, 32]               0
      Bottleneck-420             [-1, 1024, 32]               0
     BatchNorm1d-421             [-1, 1024, 32]           2,048
            ReLU-422             [-1, 1024, 32]               0
         Dropout-423             [-1, 1024, 32]               0
          Conv1d-424             [-1, 1024, 16]         525,312
 MyConv1dPadSame-425             [-1, 1024, 16]               0
     BatchNorm1d-426             [-1, 1024, 16]           2,048
            ReLU-427             [-1, 1024, 16]               0
         Dropout-428             [-1, 1024, 16]               0
          Conv1d-429             [-1, 1024, 16]         525,312
 MyConv1dPadSame-430             [-1, 1024, 16]               0
       MaxPool1d-431             [-1, 1024, 16]               0
MyMaxPool1dPadSame-432             [-1, 1024, 16]               0
      Bottleneck-433             [-1, 1024, 16]               0
     BatchNorm1d-434             [-1, 1024, 16]           2,048
            ReLU-435             [-1, 1024, 16]               0
         Dropout-436             [-1, 1024, 16]               0
          Conv1d-437             [-1, 1024, 16]         525,312
 MyConv1dPadSame-438             [-1, 1024, 16]               0
     BatchNorm1d-439             [-1, 1024, 16]           2,048
            ReLU-440             [-1, 1024, 16]               0
         Dropout-441             [-1, 1024, 16]               0
          Conv1d-442             [-1, 1024, 16]         525,312
 MyConv1dPadSame-443             [-1, 1024, 16]               0
      Bottleneck-444             [-1, 1024, 16]               0
     BatchNorm1d-445             [-1, 1024, 16]           2,048
            ReLU-446             [-1, 1024, 16]               0
         Dropout-447             [-1, 1024, 16]               0
          Conv1d-448             [-1, 1024, 16]         525,312
 MyConv1dPadSame-449             [-1, 1024, 16]               0
     BatchNorm1d-450             [-1, 1024, 16]           2,048
            ReLU-451             [-1, 1024, 16]               0
         Dropout-452             [-1, 1024, 16]               0
          Conv1d-453             [-1, 1024, 16]         525,312
 MyConv1dPadSame-454             [-1, 1024, 16]               0
      Bottleneck-455             [-1, 1024, 16]               0
     BatchNorm1d-456             [-1, 1024, 16]           2,048
            ReLU-457             [-1, 1024, 16]               0
         Dropout-458             [-1, 1024, 16]               0
          Conv1d-459             [-1, 1024, 16]         525,312
 MyConv1dPadSame-460             [-1, 1024, 16]               0
     BatchNorm1d-461             [-1, 1024, 16]           2,048
            ReLU-462             [-1, 1024, 16]               0
         Dropout-463             [-1, 1024, 16]               0
          Conv1d-464             [-1, 1024, 16]         525,312
 MyConv1dPadSame-465             [-1, 1024, 16]               0
      Bottleneck-466             [-1, 1024, 16]               0
     BatchNorm1d-467             [-1, 1024, 16]           2,048
            ReLU-468             [-1, 1024, 16]               0
         Dropout-469             [-1, 1024, 16]               0
          Conv1d-470             [-1, 1024, 16]         525,312
 MyConv1dPadSame-471             [-1, 1024, 16]               0
     BatchNorm1d-472             [-1, 1024, 16]           2,048
            ReLU-473             [-1, 1024, 16]               0
         Dropout-474             [-1, 1024, 16]               0
          Conv1d-475             [-1, 1024, 16]         525,312
 MyConv1dPadSame-476             [-1, 1024, 16]               0
      Bottleneck-477             [-1, 1024, 16]               0
     BatchNorm1d-478             [-1, 1024, 16]           2,048
            ReLU-479             [-1, 1024, 16]               0
         Dropout-480             [-1, 1024, 16]               0
          Conv1d-481             [-1, 1024, 16]         525,312
 MyConv1dPadSame-482             [-1, 1024, 16]               0
     BatchNorm1d-483             [-1, 1024, 16]           2,048
            ReLU-484             [-1, 1024, 16]               0
         Dropout-485             [-1, 1024, 16]               0
          Conv1d-486             [-1, 1024, 16]         525,312
 MyConv1dPadSame-487             [-1, 1024, 16]               0
      Bottleneck-488             [-1, 1024, 16]               0
     BatchNorm1d-489             [-1, 1024, 16]           2,048
            ReLU-490             [-1, 1024, 16]               0
         Dropout-491             [-1, 1024, 16]               0
          Conv1d-492              [-1, 1024, 8]         525,312
 MyConv1dPadSame-493              [-1, 1024, 8]               0
     BatchNorm1d-494              [-1, 1024, 8]           2,048
            ReLU-495              [-1, 1024, 8]               0
         Dropout-496              [-1, 1024, 8]               0
          Conv1d-497              [-1, 1024, 8]         525,312
 MyConv1dPadSame-498              [-1, 1024, 8]               0
       MaxPool1d-499              [-1, 1024, 8]               0
MyMaxPool1dPadSame-500              [-1, 1024, 8]               0
      Bottleneck-501              [-1, 1024, 8]               0
     BatchNorm1d-502              [-1, 1024, 8]           2,048
            ReLU-503              [-1, 1024, 8]               0
         Dropout-504              [-1, 1024, 8]               0
          Conv1d-505              [-1, 1024, 8]         525,312
 MyConv1dPadSame-506              [-1, 1024, 8]               0
     BatchNorm1d-507              [-1, 1024, 8]           2,048
            ReLU-508              [-1, 1024, 8]               0
         Dropout-509              [-1, 1024, 8]               0
          Conv1d-510              [-1, 1024, 8]         525,312
 MyConv1dPadSame-511              [-1, 1024, 8]               0
      Bottleneck-512              [-1, 1024, 8]               0
     BatchNorm1d-513              [-1, 1024, 8]           2,048
            ReLU-514              [-1, 1024, 8]               0
         Dropout-515              [-1, 1024, 8]               0
          Conv1d-516              [-1, 1024, 8]         525,312
 MyConv1dPadSame-517              [-1, 1024, 8]               0
     BatchNorm1d-518              [-1, 1024, 8]           2,048
            ReLU-519              [-1, 1024, 8]               0
         Dropout-520              [-1, 1024, 8]               0
          Conv1d-521              [-1, 1024, 8]         525,312
 MyConv1dPadSame-522              [-1, 1024, 8]               0
      Bottleneck-523              [-1, 1024, 8]               0
     BatchNorm1d-524              [-1, 1024, 8]           2,048
            ReLU-525              [-1, 1024, 8]               0
         Dropout-526              [-1, 1024, 8]               0
          Conv1d-527              [-1, 1024, 8]         525,312
 MyConv1dPadSame-528              [-1, 1024, 8]               0
     BatchNorm1d-529              [-1, 1024, 8]           2,048
            ReLU-530              [-1, 1024, 8]               0
         Dropout-531              [-1, 1024, 8]               0
          Conv1d-532              [-1, 1024, 8]         525,312
 MyConv1dPadSame-533              [-1, 1024, 8]               0
      Bottleneck-534              [-1, 1024, 8]               0
     BatchNorm1d-535              [-1, 1024, 8]           2,048
            ReLU-536              [-1, 1024, 8]               0
         Dropout-537              [-1, 1024, 8]               0
          Conv1d-538              [-1, 1024, 8]         525,312
 MyConv1dPadSame-539              [-1, 1024, 8]               0
     BatchNorm1d-540              [-1, 1024, 8]           2,048
            ReLU-541              [-1, 1024, 8]               0
         Dropout-542              [-1, 1024, 8]               0
          Conv1d-543              [-1, 1024, 8]         525,312
 MyConv1dPadSame-544              [-1, 1024, 8]               0
      Bottleneck-545              [-1, 1024, 8]               0
     BatchNorm1d-546              [-1, 1024, 8]           2,048
            ReLU-547              [-1, 1024, 8]               0
          Linear-548                    [-1, 6]           6,150
================================================================
Total params: 16,549,254
Trainable params: 16,549,254
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.14
Forward/backward pass size (MB): 230.13
Params size (MB): 63.13
Estimated Total Size (MB): 293.40
----------------------------------------------------------------
